import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv("Space_Corrected.csv")

# Завдання 1
# Побудуйте гістограму для розподілу місій за статусом (Status Mission).


df.groupby("Status Mission").plot(kind='hist')
plt.show()


# Завдання 2
# Побудуйте box plot, щоб порівняти кількість місій для різних компаній (Company Name).
#
# Завдання 3
# Побудуйте точкову діаграму, щоб показати залежність між статусом ракети (Status Rocket) та статусом місії (Status Mission).

# Завдання 4
# Побудуйте кругову діаграму, яка показує розподіл місій за локаціями запуску (Location).

# Завдання 5
# Побудуйте стовпчикову діаграму, щоб показати кількість запусків кожною компанією (Company Name).

# Завдання 6
# Побудуйте горизонтальну стовпчикову діаграму, щоб показати кількість ракет різних типів (Rocket).

# Завдання 7
# Побудуйте лінійну діаграму, яка показує кількість місій у часі (Datum).

# Завдання 8
# Побудуйте гістограму для розподілу статусу ракет (Status Rocket).

# Завдання 9
# Побудуйте box plot, щоб порівняти кількість місій (Status Mission) залежно від місця запуску (Location).

# Завдання 10
# Побудуйте точкову діаграму, щоб показати залежність між компанією (Company Name) та кількістю запусків, використовуючи колір для позначення статусу місії (Status Mission).